# Built In Failures Import Failures Import Contained Unsupported Transform Property

Source: https://www.revitapidocs.com/2026/3f7129fe-7429-decb-f8e3-f1ce0de345f0.htm

---

| Built In Failures Import Failures Import Contained Unsupported Transform Property |
| --- |

The imported geometry contains transformations which Revit does not support. Some objects may be displaced or distorted.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId ImportContainedUnsupportedTransform { get; }
```

```
Public Shared ReadOnly Property ImportContainedUnsupportedTransform As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ ImportContainedUnsupportedTransform {
	FailureDefinitionId^ get ();
}
```

```
static member ImportContainedUnsupportedTransform : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures ImportFailures Class Autodesk.Revit.DB Namespace